'''
考えたこと（改良版）

H, Wともに以下のルールで組むと実現できる
・n - 1を置く
・隣に0を置く
・隣に、0, n - 1以外で使っていない数字の一番大きいものを置く
・隣に、使っていない数字の一番小さいものを置く
以下略

ななめに交互に塗っていくイメージ

[例]n = 7
6 0 5 1 4 2 3

----------------------------------

実装
・最初に全部(.)としておく
・(#)になるところを書き換えていく
  h == 0 and w == 0, 2, 3, 4, 5, 6 (n - 1 = 6)
  w == 0 and h == 0, 2, 3, 4, 5, 6
  h == 1 なし (0)
  w == 1 なし
  h == 2 and w == 0, 2, 4, 5, 6 (n - 2 = 5)
  w == 2 and h == 0, 2, 4, 5, 6
  h == 3 and w == 0 (n - 6 = 1)
  w == 3 and h == 0
  h == 4 and w == 0, 2, 4, 6 (n - 3 = 4)
  w == 4 and h == 0, 2, 4, 6
  h == 5 and w == 0, 2 (n - 5 = 2)
  w == 5 and h == 0, 2
  h == 6 and w == 0, 2, 4 (n - 4 = 3)
  w == 6 and h == 0, 2, 4
  

差分？を取ると（ここまだわからぬ）
h(w) == 0 の時 0, 2, 3, 4, 5, 6を塗る
h(w) == 2 の時 4, 5, 6
h(w) == 4 の時 6



'''

n = int(input())
grid = [['.'] * n for _ in range(n)]

for i in range(n // 2):
  h = i * 2
  grid[h][h] = '#'
  if h + 2 < n:
    for w in range(h + 2, n):
      # print(h, w)
      grid[h][w] = '#'
      grid[w][h] = '#'

for i in grid:
  print(*i, sep='')
